StartMilandr/MDR_Pack_v6/SVD_Files/BKP/MDR1986VE9x_BKP.svd
            <!--Trim dDUcc-->
            <field>
              <name>Trim_dDUcc</name>
              <description>Ducc adjust voltages</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__dDUcc_</headerEnumName>
                <enumeratedValue>
                  <name>+0.1</name>
                  <description>DUcc += 0.1 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>+0.06</name>
                  <description>DUcc += 0.06 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>+0.04</name>
                  <description>DUcc += 0.04 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>+0.01</name>
                  <description>DUcc += 0.01 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.01</name>
                  <description>DUcc -= 0.01 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.04</name>
                  <description>DUcc -= 0.04 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.6</name>
                  <description>DUcc -= 0.06 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.1</name>
                  <description>DUcc -= 0.1 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            
            <!--FPOR-->
            <field>
              <name>FPOR</name>
              <description>Power Reset Flag</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__FPOR_</headerEnumName>
                <enumeratedValue>
                  <name>Low</name>
                  <description>No Bootloader</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Bootloader completed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            
            <!--Trim DUcc-->
            <!--#BE1, #BE9x,#VC1,#BE4,#BK214,#BK234-->
            <!--field>
              <name>Trim_DUcc</name>
              <description>Select DUcc voltage</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__DUcc_</headerEnumName>
                <enumeratedValue>
                  <name>1.8</name>
                  <description>DUcc = 1.8 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1.6</name>
                  <description>DUcc = 1.6 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1.4</name>
                  <description>DUcc = 1.4 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1.2</name>
                  <description>DUcc = 1.2 V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            
            <!--Trim DUcc-->
            <!--#BE3-->
            <!--field>
              <name>Trim_DUcc</name>
              <description>Select DUcc voltage</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__DUcc_</headerEnumName>
                <enumeratedValue>
                  <name>1.8</name>
                  <description>DUcc = 1.8 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1.6</name>
                  <description>DUcc = 1.6 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1.4</name>
                  <description>DUcc = 1.4 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Forbiden</name>
                  <description>Forbiden value</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            
            <!--COVDET-->
            <!--#BE4,#BK214,#BK234-->
            <!--field>
              <name>COVDET</name>
              <description>Breaking access flag</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__COVDET_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>No dreaking access detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Breaking access detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            
            <!--MODE-->
            <!--#BE9,#VC1-->
            <field>
              <name>MODE</name>
              <description>Bootloading Mode</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__MODE_</headerEnumName>
                <enumeratedValue>
                  <name>IntFlash_JtagB</name>
                  <description>Execute from internal flash with Jtag_B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IntFlash_JtagA</name>
                  <description>Execute from internal flash with Jtag_A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ExtMem_JtagB</name>
                  <description>Execute from external memory with Jtag_B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ExtMem_JtagOff</name>
                  <description>Execute from external memory without any Jtag</description>
                  <value>3</value>
                </enumeratedValue>
                <!--#BE9, DELETE for #VC1-->
                <enumeratedValue>
                  <name>Uart_PD01</name>
                  <description>Uart bootloader, pins PD[1:0]</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Uart_PF01</name>
                  <description>Uart bootloader, pins PF[1:0]</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <!--I_LimEn-->
            <!--#BE1, #BE3,#BE4,#BK214,#BK234-->
            <!--field>
              <name>I_LimEn</name>
              <description>Enable I 150mA protection</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__Ilim_</headerEnumName>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->

          </fields>
        </register>

